<a href="https://colab.research.google.com/github/rgranit/academix-ydata-project/blob/master/code/1_clean_NIH_dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!pip install boto

Collecting boto
  Downloading https://files.pythonhosted.org/packages/23/10/c0b78c27298029e4454a472a1919bde20cb182dab1662cec7f2ca1dcc523/boto-2.49.0-py2.py3-none-any.whl (1.4MB)
     |████████████████████████████████| 1.4MB 1.4MB/s
Installing collected packages: boto
Successfully installed boto-2.49.0

In [0]:
''' Initializations '''
from boto.s3.connection import S3Connection
from boto.s3.key import Key
from boto import s3
import boto3, os, re
import pandas as pd

conn = S3Connection('AKIAIA55FCCZKLRCFQKQ', 'o2henMil6VH05YEONVSYWspukjoeUwqwG1aRhC0L')

mybucket = conn.get_bucket('ayp-data')
key = mybucket.get_key('NIH_precleaning.csv')
key.get_contents_to_filename('testdata.csv')

df = pd.read_csv('testdata.csv')
df.drop('Unnamed: 0',axis=1, inplace=True)

Does the same PMID exist within several years?

In [3]:
df

             PMID  ...                                           PI_NAMEs
0        19415686  ...                                     TUAN, ROCKY S;
1        19650110  ...                                     TUAN, ROCKY S;
2        19283731  ...                                     TUAN, ROCKY S;
3        19274753  ...                                     TUAN, ROCKY S;
4        19479830  ...                                     TUAN, ROCKY S;
...           ...  ...                                                ...
5273786  25537070  ...                                 TRUJILLO, KEITH A;
5273787  25537070  ...                                 ROCHA, VICTOR NMN;
5273788  25747927  ...  GLASNER-EDWARDS, SUZETTE V; KARNO, MITCHELL P ...
5273789  25629155  ...                                   D'SOUZA, RENA N;
5273790  25885816  ...                                   AUNE, THOMAS M.;

[5273791 rows x 5 columns]

In [0]:
def separate_names(names):
  try:
    each_name = names.strip().replace(', ', ' ').split(' ')
    if (len(each_name) == 1):
      new_name = "BAD_NAME"
    elif (len(each_name) == 2):
      new_name = each_name[0] + "_" + each_name[1][0] 
    else:
      if len(each_name[2]) == 1:
        new_name = each_name[0] + "_" + each_name[1][0] + each_name[2]
      else:
        new_name = each_name[0] + "_" + each_name[1][0] + each_name[2][0]
  except:
    print(names)
  return new_name

def clean_name(name):
  name = name.lower()
  names = name.split(';')


  #remove contact names in database
  names = [re.sub(r'.*\(contact\).*',"",name) for name in names]
  #remove optional other last name from name
  names = [re.sub(r' \(.*\)',"",name) for name in names]
  #remove extra spaces
  names = [re.sub(r' +',' ',name) for name in names]
  #for the few cases where have " , " instead of ", "
  names = [re.sub(r' , ',', ',name) for name in names]
  #remove empty strings
  names = list(filter(lambda x: x != "", names))

  if len(names) == 0:
    print("ERROR WITH NAME: ", name)
    return "ERROR WITH NAME"

  elif len(names) == 1:
    new_name = separate_names(names[0])
      
  else:
    new_name = []
    for name in names:
      new_name.append(separate_names(name))

  return new_name

In [0]:
df['cleaned_name'] = [clean_name(name) for name in df['PI_NAMEs']]

In [204]:
df.head()

       PMID PROJECT_NUMBER    FY    PI_IDS        PI_NAMEs cleaned_name
0  19415686    ZIAAR041131  2009  1858712;  TUAN, ROCKY S;      tuan_rs
1  19650110    ZIAAR041131  2009  1858712;  TUAN, ROCKY S;      tuan_rs
2  19283731    ZIAAR041131  2009  1858712;  TUAN, ROCKY S;      tuan_rs
3  19274753    ZIAAR041131  2009  1858712;  TUAN, ROCKY S;      tuan_rs
4  19479830    ZIAAR041131  2009  1858712;  TUAN, ROCKY S;      tuan_rs

In [209]:
df.to_csv("./NIH_postcleaning.csv")
mykey = mybucket.get_key('NIH_postcleaning.csv')
if mykey is None:
  mykey = Key(mybucket)
  mykey.key = 'NIH_postcleaning.csv'
mykey.set_contents_from_filename('./NIH_postcleaning.csv')

406607944